/**
 * Welcome to Cloudflare Workers! This is your first worker.
 *
 * - Run `npm run dev` in your terminal to start a development server
 * - Open a browser tab at http://localhost:8787/ to see your worker in action
 * - Run `npm run deploy` to publish your worker
 *
 * Learn more at https://developers.cloudflare.com/workers/
 */

import OpenAI from "openai";

const corsHeaders = {
	'Access-Control-Allow-Origin': '*',
	'Access-Control-Allow-Methods': 'POST, OPTIONS',
	'Access-Control-Allow-Headers': 'Content-Type',
	'Content-Type': 'text/event-stream',
	'Cache-Control': 'no-cache',
	'Connection': 'keep-alive'
};

export default {
	async fetch(request, env, ctx) {
		if (request.method === 'OPTIONS') {
			return new Response(null, { headers: corsHeaders });
		}

		let oInputs = { text: "" };
		const contentLength = request.headers.get('content-length');
		if (contentLength && parseInt(contentLength) > 0) {
			oInputs = await request.json();
		}

		const sPrompt = `

		אני רוצה לזקק כמה שיותר מידע משפטי מפרומפט שתקבל. 
		אני הולך לתאר את סוג המידע שאני מבקש לקבל. אם אין החזר מחרוזת ריקה. אנא החזר את המידע ב-JSON.
		
		מזהה תיק וסוג תיק:
		הם בדרך כלל מופיעים אחד אחרי השני כשביניהם מפריד רווח אחד או יותר. לעיתים נדירות תמצא תו אחר (שאיננו מספר או אות) שמפריד ביניהם.
		TikId - מזהה התיק מורכב אך ורק ממחרוזות של ספרות כשביניהן מקף או לוכסן או נקודה. 
		Tik_Type - סוג התיק. מכיל מחרוזת של עד ארבע אותיות בעברית, לפעמים מופיעים גם גרשיים באמצע. את הגרשיים תמחק מהתוצאה המוחזרת.
		למשל:
		123/45 עא
		TikId - 123/45
		Tik_Type - עא

		דוגמא 2:
		13124-15/25 ב"ש
		TikId - 13124-15/25
		Tik_Type - בש

		ערכאה:
		ערכאת התיק.
		
		למטה אני מפרט רשימה של ערכאות אפשריות לבחירה. אתה צריך להחזיר רק ערכאה מתוך הרשימה הזו, הערכאה הכי קרובה לערכאה שנמצאת במסמך:
		אם לא מצאת ערכאה אל תחזיר ערך.
		
		INTERNATIONAL COURT OF JUSTICE
		suprem court of the united states 
		בית דין אזורי לעבודה
		בית דין למשמעת של עובדי מדינה                     
		בית דין למשמעת של רשויות מקומיות                  
		בית דין לענייני מים                               
		בית דין משמורת של שוהים שלא כדין                  
		בית דין צבאי                                      
		בית דין רבני                                      
		בית דין רבני גדול
		בית הדין הארצי לעבודה
		בית הדין המשמעתי לשכת עורכי הדין
		בית הדין הצבאי לערעורים
		בית הדין להגבלים עסקיים                           
		בית הדין לחוזים אחידים                            
		בית הדין לעררים לפי חוק הכניסה לישראל
		בית הדין לשכירות                                  
		בית המשפט העליון
		בית המשפט הצבאי                                   
		בית המשפט לימאות                                  
		בית המשפט לענייני משפחה
		בית משפט לנוער
		בית משפט לעניינים מנהליים                         
		בית משפט לעניינים מקומיים                         
		בית משפט לתביעות קטנות                            
		בית משפט לתעבורה                                  
		בית משפט מחוזי
		בית משפט שלום
		המועצה הארצית לתכנון ובנייה
		הממונה על ההגבלים העסקיים                         
		המפקח על רישום המקרקעין                           
		ועדת אתיקה                                        
		ועדת האתיקה של השופטים
		ועדת הבחירות המרכזית לכנסת
		ועדת הבחירות לכנסת
		ועדת הערעורים לפי חוק הנכים                       
		ועדת הערר לפי חוק כביש אגרה
		ועדת השחרורים                                     
		ועדת ערר - שירות קבע
		ועדת ערר לענייני ארנונה
		ועדת ערר לענייני ביוב
		ועדת ערר לפי חוק נתיבים מהירים
		ועדת ערר לפיצויים ולהיטל השבחה
		ועדת ערר לתכנון ובניה
		ועדת ערר מס רכוש
		ועדת ערר מס שבח
		ועדת ערר תכנון ובניה - ארצי
		ועדת ערר תכנון ובניה - מחוזי
		ועדת עררים לפי חוק נכי רדיפות הנאצים              
		לשכות ההוצאה לפועל                                
		מועצת העתונות בישראל                              
		מינהלת תנופה
		פסיקה זרה                                         
		פסקי משקם
		רשות השיפוט הארצית                                
		רשם האגודות השיתופיות                             
		רשם הפטנטים                                       
		רשם לענייני ירושה                                 
		שונות
		
		דוגמא למיפוי:
		בית משפט השלום = בית משפט שלום
		בית המשפט המחוזי = בית משפט מחוזי
		
		יכולים להיות עד שלושה שדות של ערכאה:
		שם השדה - Arkaa_Type
		שם השדה - Arkaa_Type2
		שם השדה - Arkaa_Type3
		
		
		אזור:
		
		אם יש התאמה ישירה בין המחרוזת הנתונה לאזור מהרשימה, החזר את ההתאמה הישירה.
		אם לא, בצע חיפוש בהתאמה חלקית.
		אם לא מצאת אזור, אל תחזיר ערך.
		רשימת אזורים:
		
		אוסטרליה
		אילת
		ארה"ב
		אריאל
		ארצי
		אשדוד
		אשקלון
		באר שבע
		בית-שאן
		בית-שמש
		בני-ברק
		בריטניה
		בת-ים חולון
		גבעתיים
		דימונה
		דנמרק
		האיחוד האירופי
		הולנד
		הרצליה
		חדרה
		חיפה
		טבריה
		יהודה
		יהודה ושומרון
		ירושלים
		כפר-סבא
		לוד
		מחוז דרום
		מחוז חיפה
		מחוז ירושלים
		מחוז מרכז
		מחוז צפון
		מסעדה
		מעלה אדומים
		מרכז
		נהריה
		נצרת
		נתניה
		עכו
		עפולה
		פתח תקוה
		צפת
		קנדה
		קצרין
		קריות
		קרית ביאליק
		קרית גת
		קרית שמונה
		ראשון לציון
		רחובות
		רמלה
		רמת גן
		רמת השרון
		רעננה
		תל אביב
		
		
		אם הערכאה היא מסוג בית המשפט העליון או בית דין ארצי לעבודה, אז שדה האזור צריך להישאר ריק.
		
		דוגמאות:
		
		דוגמא 1:
		נמצא במסמך: "יהודה"
		הערך שאתה מחזיר: "יהודה ושומרון"
		
		דוגמא 2:
		נמצא במסמך:"בת-ים"
		הערך שאתה מחזיר: "בת-ים חולון"
		
		דוגמא 3:
		נמצא במסמך: "מרכז לוד"
		הערך שאתה מחזיר: "מרכז"
		
		דוגמא 4:
		נמצא במסמך: "תל אביב"
		הערך שאתה מחזיר: "תל אביב"
		
		יכולים להיות עד שלושה שדות של אזור:
		שם השדה - Ezor
		שם השדה - Ezor2
		שם השדה - Ezor3
		
		באי כוח:
		הפרומפט יכול להכיל גם את באי הכוח, כלומר עו"ד שמייצגים את הצדדים.
		שם השדה - OrechDin1
		
		צדדים:
		לפעמים הפרומפט יכיל צד אחד או שני או את שניהם. 
		שם השדות:
		צד א' - Zad1
		צד ב' - Zad2
		
		
		סוג פסק דין:
		יכול להיות רק אחד מהערכים הבאים:
		גזר דין
		החלטה
		הכרעת דין
		פס"ד
		פסק בורר
		
		שם השדה: PsakDin_Type
		
		שופט:
		שם השופט/ים.
		שם השדה:Shofet
		
		מתאריך:
		פסקי דין מתאריך
		התאריך יגיע בפורמט של 
		dd/mm/yy
		או
		dd/mm/yyyy
		אתה צריך לחלק לשלושה שדות:
		D1 - יום
		M1 - חודש
		Y1 - שנה. את השנה, אם צריך תהפוך לארבע ספרות
		
		עד תאריך:
		פסקי דין עד תאריך
		התאריך יגיע בפורמט של 
		dd/mm/yy
		או
		dd/mm/yyyy
		אתה צריך לחלק לשלושה שדות:
		D2 - יום
		M2 - חודש
		Y2 - שנה. את השנה, אם צריך תהפוך לארבע ספרות
		
		אזכורי חקיקה:
		כאשר מופיע אזכור חקיקה ניתן לחלק אותו לשניים:
		שם החוק המאוזכר:
		שם השדה: IskurHokNm1
		
		שם הסעיף בחוק המאוזכר:
		שם השדה: IskurHokSeif1
		
		אזכור פסיקה:
		שם השדה: IskurP
		
		טווח החיפוש:
		בשדה הזה נציין מה החיפוש יכלול.
		בחר את הערך הקרוב ביותר מבין הערכים הבאים:
		כל פסקי הדין
		פסקי דין שכבר נצפו
		פסקי דין שלא נצפו
		שם השדה vPsak
		
		חיפוש טקסטואלי:
		ייתכן ותקבל טקסט משפטי בשפה טבעית (טקסט שמתאר מקרה, תביעה, אירוע או נושא).  
		את הטקסט החופשי תצטרך לתרגם למונחי חיפוש בממשק חיפוש שיתארו בצורה הטובה ביותר את הבעיה
		ממשק החיפוש מורכב  מארבע שורות חיפוש שמקיימות ביניהן את היחס של 'וגם'.
		כל שורה מורכבת משלושה שדות המקיימים ביניהם את היחס של 'או'.
		המיפוי לשדות הוא כדלהלן:
		T1	או T2	או T3
		וגם
		T11	או T21	או T31
		וגם
		T12	או T22	 או T32
		וגם 
		T13	או T23	או T33
		
		עליך לבצע המרה מדויקת וחסכנית. אל תשתמש בכל שדות החיפוש אלא אם כן זה הכרחי כדי לתרגם במלואו את הטקסט החופשי.
		
		דוגמא:
		פרומפט:"הלקוח שלי טופל בבית חולים בצורה רשלנית וכתוצאה מכך איבד את רגלו. אילו פסקי דין אמורים לעניין אותי ?"
		T1 = רשלנות רפואית
		T11 = בית חולים
		T12 = איבוד רגל
		
		דוגמא: 
		פרומפט: לקוח רכש דירה וגילה ליקויי בנייה חמורים שלא תוקנו על-ידי הקבלן
		T1 = רכישת דירה
		T2 = קניית דירה
		T11 = ליקויי בנייה
		
		דוגמא:
		פרומפט: עובד פוטר ממקום עבודתו בטענה להתנהגות בלתי הולמת, אך טוען שפוטר ללא שימוע כדין
		T1 = פיטורים שלא כדין
		T11 = שימוע
		T12 = התנהגות בלתי הולמת
		
		דוגמא:
		פרומפט: נהג רכב פגע בהולך רגל במעבר חציה וגרם לו לפציעות קשות
		T1 = תאונת דרכים
		T11 = פגיעה בהולך רגל
		T12 = מעבר חציה
		
		דוגמא:
		פרומפט: אם חד הורית תובעת מזונות מהאב שאינו משלם מזונות לילדיו
		T1 = תשלום מזונות
		T11 = אם חד הורית
		
		דוגמא:
		פרומפט: עובד תובע שעות נוספות שלא שולמו לו במשך שנתיים
		T1 = שעות נוספות
		T11 = תשלום
				
		דוגמא:
		פרומפט: לקוח טוען כי הבנק גבה ממנו ריבית חריגה בניגוד להסכם ההלוואה
		T1 = ריבית חריגה
		T11 = בנק
		
		דוגמא:
		פרומפט: נאשם מואשם בהחזקת סמים מסוכנים לשימוש עצמי
		T1 = החזקת סמים
		T11 = שימוש עצמי
		T21 = צריכה עצמית
		T12 = סמים מסוכנים
		
		דוגמא:
		פרומפט: עובדת בהריון פוטרה ממקום עבודתה ללא היתר מהממונה על עבודת נשים
		T1 = פיטורי עובדת בהריון
		T11 = ללא היתר
		
		דוגמא:
		פרומפט: דייר טוען כי בעל הדירה מסרב להחזיר לו את פיקדון השכירות בסיום החוזה
		T1 = פיקדון שכירות
		T11 = מסרב להחזיר
		
		דוגמא:
		פרומפט: לקוח טוען כי חברת ביטוח דחתה את תביעתו לפיצוי בגין נזקי מים בדירה
		T1 = תביעת ביטוח
		T11 = נזקי מים
		T12 = דחיית תביעה
		
		דוגמא:
		פרומפט: תלמיד בבית ספר נפגע במהלך טיול שנתי כתוצאה מרשלנות המורים
		T1 = פציעת תלמיד
		T11 = טיול שנתי
		T12 = רשלנות
		
		דוגמא:
		הלקוח שלי מחפש מסמכים המכילים התחלה חדשה או ישנה וגם ניסוי מוצלח
		T1 = התחלה חדשה
		T2 = התחלה ישנה
		T11 = ניסוי מוצלח
		
		`;

		const oOpenAi = new OpenAI({
			apiKey: env.OPENAI_API_KEY,
			baseURL: "https://gateway.ai.cloudflare.com/v1/1719b913db6cbf5b9e3267b924244e58/extract-search-fields-from-prompt/openai"
		});

		const messagesForOpenAI = [
			{ role: 'system', content: sPrompt.trim() },
			{ role: 'user', content: oInputs.prompt },
		];

		const chatCompletion = await oOpenAi.chat.completions.create({
			model: "gpt-4.1-mini",
			messages: messagesForOpenAI,
			temperature: 0,
			presence_penalty: 0,
			frequency_penalty: 0,
			stream: false
		});

		const sResponse = chatCompletion.choices?.[0]?.message?.content || "";

		return new Response(sResponse, { headers: corsHeaders });
	}
};
